#!/usr/bin/env perl 

use strict;
use warnings;
use utf8;

binmode STDOUT,':encoding(utf8)';

use Data::Dumper qw(Dumper);

use Plg::Projs::Tex qw( texify );

my %str;

my $s = q{
\lettrine[lines=3]{5}{листопада 1968 року} поряд із будинком на вулиці Хрещатик, 27-а в Києві
з'явився охоплений полум'ям чоловік. Він кричав: "Геть комуністичних
колонізаторів!" і "Хай живе вільна Україна!"

Пробігши кілька метрів у бік нинішнього Майдану Незалежності, Василь Макух
упав. Свідки і міліція спробували загасити вогонь, але не змогли зробити це
швидко. Наступного дня він помер у лікарні від опіків 70\% тіла.

У радянських газетах про його вчинок не було жодного повідомлення. Факт
самоспалення прагнули приховати, але за кордоном і в самвидаві про
Макуха писали. Друзі згадували про його плани вийти на несанкціоновану
демонстрацію на знак протесту проти окупації Чехословаччини, знайомі –
про його ув'язнення в Сибіру і участь в УПА.

"b"
};

texify(\$s);
print qq{$s} . "\n";
